Autodesk.Revit.DB.Structure.RebarSpliceByRulesResult.GetSpliceGeometries
Gets the RebarSpliceGeometry collection which is the result of the splice by rules operation.
Returns:
Returns the RebarSpliceGeometry collection which is the result of the splice by rules operation.
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceByRulesResult.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarSpliceByRulesResult.Error
Identifies the error that occured during the splice by rules operation. In case of success the value of this property will be Success.
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceByRulesResult
Class that encapsulates the result of the splice by rules operation.
Remarks:
This class contains a collection of RebarSpliceGeometry which is the result of the splice and a RebarSpliceByRulesError member.
After splice by rules operation check the Error member for RebarSpliceByRulesError.Success value and retrieve the RebarSpliceGeometry collection.
If the splice by rules operation fails the Error member will contain a meaninful error.
Since:
2025